Ran Plan for 5 projects:

1. project: `ansible-role-docker-host` dir: `repositories/ansible-role-docker-host` workspace: `default`
1. project: `ansible-role-os-updates` dir: `repositories/ansible-role-os-updates` workspace: `default`
1. project: `ansible-role-packages` dir: `repositories/ansible-role-packages` workspace: `default`
1. project: `ansible-role-server-hardening` dir: `repositories/ansible-role-server-hardening` workspace: `default`
1. project: `ansible-role-users` dir: `repositories/ansible-role-users` workspace: `default`

### 1. project: `ansible-role-docker-host` dir: `repositories/ansible-role-docker-host` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Ansible role to configure a Docker host"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "ansible-role-docker-host"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "ansible",
          + "docker",
        ]
      + visibility             = "private"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ansible-role-docker-host`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fgithub-repo-management%252Frepositories%252Fansible-role-docker-host%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ansible-role-docker-host`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `ansible-role-os-updates` dir: `repositories/ansible-role-os-updates` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Ansible role to configure a OS update mechanisms"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "ansible-role-os-updates"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "ansible",
        ]
      + visibility             = "private"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ansible-role-os-updates`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fgithub-repo-management%252Frepositories%252Fansible-role-os-updates%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ansible-role-os-updates`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. project: `ansible-role-packages` dir: `repositories/ansible-role-packages` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Ansible role to configure packages"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "ansible-role-packages"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "ansible",
        ]
      + visibility             = "private"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ansible-role-packages`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fgithub-repo-management%252Frepositories%252Fansible-role-packages%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ansible-role-packages`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 4. project: `ansible-role-server-hardening` dir: `repositories/ansible-role-server-hardening` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Ansible role to configure server hardening options"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "ansible-role-server-hardening"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "ansible",
        ]
      + visibility             = "private"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ansible-role-server-hardening`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fgithub-repo-management%252Frepositories%252Fansible-role-server-hardening%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ansible-role-server-hardening`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 5. project: `ansible-role-users` dir: `repositories/ansible-role-users` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.github_repository.github_repository.repo: Refreshing state... [id=arch-aur-pkgbuilds]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repository.github_repository.repo has changed
~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"a29eb662e5ce4f595e65a2275f68f067e9601eb33367524136fe566146937119\"" -> "W/\"ba4b54f19d0c8c4677c6f7b14ee392a8125855c3ac50703d80f7f0779820e4df\""
      ~ full_name              = "simonweald/arch-aur-pkgbuilds" -> "a7d-corp/arch-aur-pkgbuilds"
      ~ git_clone_url          = "git://github.com/simonweald/arch-aur-pkgbuilds.git" -> "git://github.com/a7d-corp/arch-aur-pkgbuilds.git"
      ~ html_url               = "https://github.com/simonweald/arch-aur-pkgbuilds" -> "https://github.com/a7d-corp/arch-aur-pkgbuilds"
      ~ http_clone_url         = "https://github.com/simonweald/arch-aur-pkgbuilds.git" -> "https://github.com/a7d-corp/arch-aur-pkgbuilds.git"
        id                     = "arch-aur-pkgbuilds"
        name                   = "arch-aur-pkgbuilds"
      ~ ssh_clone_url          = "git@github.com:simonweald/arch-aur-pkgbuilds.git" -> "git@github.com:a7d-corp/arch-aur-pkgbuilds.git"
      ~ svn_url                = "https://github.com/simonweald/arch-aur-pkgbuilds" -> "https://github.com/a7d-corp/arch-aur-pkgbuilds"
        # (21 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be updated in-place
~ resource "github_repository" "repo" {
      ~ description            = "PKGBUILDS for AUR packages I maintain" -> "Ansible role to configure users on a Linux machine"
        id                     = "arch-aur-pkgbuilds"
      ~ name                   = "arch-aur-pkgbuilds" -> "ansible-role-users"
      ~ topics                 = [
          + "ansible",
          - "arch",
          - "archlinux",
          - "aur",
          - "pkgbuild",
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ansible-role-users`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fgithub-repo-management%252Frepositories%252Fansible-role-users%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ansible-role-users`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
